app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["instructions", "a"], ["created_at", "2021-04-26 21:38:20.480502"], ["updated_at", "2021-04-26 21:38:20.480502"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2021-05-04 23:03:39.103476"], ["updated_at", "2021-05-04 23:03:39.103476"]]
UPDATE "ingredients" SET "measurement" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["measurement", "test"], ["updated_at", "2021-05-04 23:03:39.107168"], ["id", 15]]
---
  def update
    # binding.pry
    # find recipe id in db and save to var
    recID = Recipe.find(params[:id].to_i)
    # access ingredients through recipe id variable
    @ingredient = Ingredient.create(name: params[:ingredients_attributes][:name])
    @ingredient.measurement = params[:ingredients_attributes][:measurement]
    @ingredient.save